// パッケージ
/*
パッケージは、ファイルに対する「フォルダ」のようなもの
様々なJavaのファイルをまとめたもの

パッケージA
 |- クラスA
 |- クラスB
 |- クラスC
 |- インターフェースA

パッケージB
 |- クラスX
 |- クラスY
 |- クラスZ


＊Javaで用意されている主なパッケージ
[java.lang(ラング)]
 -> Javaの基本的な機能を提供するクラス群(多くのクラスで使用)
[java.util(ユーティル)]
 -> 便利な機能を提供するクラス群(コレクションフレームワーク)
[java.io(アイオー)]
 -> 入出力を扱うクラス群(入出力処理)
[javax.swing(エックス・スイング)]
 -> グラフィカルなインターフェースを実現する為のコンポーネントを提供するクラス群
    (GUIアプリケーション作成)
[java.awt(エーダブリューティー)]
 -> 2次元の図形描画に関するクラス群(描画処理)
[java.awt.event(エーダブリューティー・イベント)]
 -> コンポーネントからのイベントを処理する為のクラス群(イベント処理)
[java.net(ネット)]
 -> ネットワーク機能を提供するクラス群(ネットワークの接続処理)


＊importの宣言
プログラムコードの先頭に「import」で宣言する
import パッケージ名.クラス名;


＊パッケージの作成
プログラムコードの先頭に記述する事で、パッケージは自分で作成出来る。
package パッケージ名;
*/


public class Test17{
  public static void main(String[] args) {

  }
}
